Конфигурация/src/Documents/РасходДенег/РасходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенег</name>
  <registerRecords>AccumulationRegister.ОстаткиДенег</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыДенег</registerRecords>
  <attributes>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>СтатьяДвижения</name>
      <type>
        <types>CatalogRef.ДвиженияДенег</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ОстаткиДенег/ОстаткиДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.ДвиженияДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтатьиДвижения</name>
    <type>
      <types>EnumRef.ВидыСтатейДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/ОборотыДенег/ОборотыДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыДенег</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.Кошельки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.ДвиженияДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтатьиДвижения</name>
    <type>
      <types>EnumRef.ВидыСтатейДвижения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/AccumulationRegisters/РезервыДенег/РезервыДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыДенег</name>
  <comment>Доп. функционал</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.ДвиженияДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Enums/ВидыСтатейДвижения/ВидыСтатейДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатейДвижения</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/РасходДенег/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Блокировка = Новый БлокировкаДанных;

    Остатки = Блокировка.Добавить("РегистрНакопления.ОстаткиДенег");
    Остатки.Режим = РежимБлокировкиДанных.Исключительный;
    Обороты = Блокировка.Добавить("РегистрНакопления.ОборотыДенег");
    Обороты.Режим = РежимБлокировкиДанных.Исключительный;
    Резервы = Блокировка.Добавить("РегистрНакопления.РезервыДенег");
    Резервы.Режим = РежимБлокировкиДанных.Исключительный;
    Резервы.УстановитьЗначение("Месяц", НачалоМесяца(Дата));

    Блокировка.Заблокировать();
	
	Движения.ОстаткиДенег.Записывать = Истина;
	Движения.ОборотыДенег.Записывать = Истина;

	СуммаКСписанию = ТабличнаяЧасть.Итог("Сумма");
	ДоступноКРасходуСтруктура = ПосчитатьДоступныеДеньгиЗаВычетомЗарезервированных();

	Если СуммаКСписанию > ДоступноКРасходуСтруктура.ДоступноКРасходу Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон(
			"Недостаточно средств.
			|Попытка списать %1
			|В выбранном кошельке: %2
        	|В остальных кошельках: %3
        	|Неоплаченные резервы месяца (всего %4): %5
        	|Итого доступно: %6",
			Формат(СуммаКСписанию, "ЧДЦ=2; ЧН=0,00"),
	        Формат(ДоступноКРасходуСтруктура.ДоступноДенегВВыбранномКошельке, "ЧДЦ=2; ЧН=0,00"),
	        Формат(ДоступноКРасходуСтруктура.ДоступноДенегВОстальныхКошельках, "ЧДЦ=2; ЧН=0,00"),
	        Формат(ДоступноКРасходуСтруктура.ОсталосьОплатитьРезервы, "ЧДЦ=2; ЧН=0,00"),
	        ДоступноКРасходуСтруктура.ДеталиРезервов,
			Формат(ДоступноКРасходуСтруктура.ДоступноКРасходу, "ЧДЦ=2; ЧН=0,00"), 
		);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ТекСтрока из ТабличнаяЧасть Цикл
		
		// регистр ОстаткиДенег
		ДвижениеОстаткиДенег = Движения.ОстаткиДенег.ДобавитьРасход();
		ДвижениеОстаткиДенег.Период = Дата;
		ДвижениеОстаткиДенег.Кошелек = Кошелек;
		ДвижениеОстаткиДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеОстаткиДенег.ВидСтатьиДвижения = Перечисления.ВидыСтатейДвижения.Расход;
		ДвижениеОстаткиДенег.Сумма = ТекСтрока.Сумма;
		
		// регистр ОборотыДенег
		ДвижениеОборотыДенег = Движения.ОборотыДенег.Добавить();
		ДвижениеОборотыДенег.Период = Дата;
		ДвижениеОборотыДенег.Кошелек = Кошелек;
		ДвижениеОборотыДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеОборотыДенег.ВидСтатьиДвижения = Перечисления.ВидыСтатейДвижения.Расход;
		ДвижениеОборотыДенег.Сумма = ТекСтрока.Сумма;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Посчитать доступные деньги за вычетом зарезервированных.
//
// Возвращаемое значение:
//  Структура - Посчитать доступные деньги за вычетом зарезервированных:
//      * ДоступноКРасходу - Число
//      * ДоступноДенегВВыбранномКошельке - Число
//      * ДоступноДенегВОстальныхКошельках - Число
//      * ОсталосьОплатитьРезервы - Число
//      * ДеталиРезервов - Строка
Функция ПосчитатьДоступныеДеньгиЗаВычетомЗарезервированных() Экспорт

	ТаблицаОстатковИРезервов = ВернутьТаблицуЗначенийОстатковИРезервов();
	
    ДоступноДенегВВыбранномКошельке = 0;
    ДоступноДенегВОстальныхКошельках = 0;
        
    Если ТаблицаОстатковИРезервов.Количество() > 0 Тогда
    	
    	ОбщаяСтрока = 0;
        ДоступноДенегВВыбранномКошельке = ТаблицаОстатковИРезервов[ОбщаяСтрока].ДоступноДенегВВыбранномКошельке;
        ДоступноДенегВОстальныхКошельках = ТаблицаОстатковИРезервов[ОбщаяСтрока].ДоступноДенегВОстальныхКошельках;
        
    КонецЕсли;

	ОсталосьОплатитьРезервы = 0;
	ДеталиРезервов = "";
	
	Для Каждого Строка Из ТаблицаОстатковИРезервов Цикл
		
        РезервПоСтатье = Строка.СуммаРезерваПоСтатье - Строка.УжеОплаченоПоСтатье;
        
        // Если по статье резерва ещё остался долг
        Если РезервПоСтатье > 0 Тогда
        	
            ОсталосьОплатитьРезервы = ОсталосьОплатитьРезервы + РезервПоСтатье;
			ДеталиРезервов = ДеталиРезервов + Символы.ПС + СтрШаблон(
				" - %1: %2",
				Строка.СтатьяДвижения,
				Формат(РезервПоСтатье, "ЧДЦ=2; ЧН=0,00")
			);
            
        КонецЕсли;
		
	КонецЦикла;
	
	ДенегВоВсехКошельках = ДоступноДенегВВыбранномКошельке + ДоступноДенегВОстальныхКошельках;
	// Может быть отрицательным, если зарезервированных платежей больше, чем денег на кошельках
	СвободныйОстатокЗаВычетомНеоплаченныхРезервов = ДенегВоВсехКошельках - ОсталосьОплатитьРезервы;
	// Ограничить потенциальный расход размером баланса кошелька
	ПотенциальныйРасход = Мин(ДоступноДенегВВыбранномКошельке, СвободныйОстатокЗаВычетомНеоплаченныхРезервов);
	// Вернуть ноль, если зарезервированные неоплаченные расходы больше общего баланса
	ДоступноКРасходу = Число(Макс(ПотенциальныйРасход, 0));
	
	Результат = Новый Структура;
	
    Результат.Вставить("ДоступноКРасходу", ДоступноКРасходу);
    Результат.Вставить("ДоступноДенегВВыбранномКошельке", ДоступноДенегВВыбранномКошельке);
    Результат.Вставить("ДоступноДенегВОстальныхКошельках", ДоступноДенегВОстальныхКошельках);
    Результат.Вставить("ОсталосьОплатитьРезервы", ОсталосьОплатитьРезервы);
    Результат.Вставить("ДеталиРезервов", ДеталиРезервов);
    
    Возврат Результат;

КонецФункции

// Вернуть остатки и резервы.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Вернуть остатки и резервы:
//		*ДоступноДенегВВыбранномКошельке - Число
//		*ДоступноДенегВОстальныхКошельках - Число
//		*СтатьяДвижения - СправочникСсылка.ДвиженияДенег
//		*СуммаРезерваПоСтатье - Число
//		*УжеОплаченоПоСтатье - Число
Функция ВернутьТаблицуЗначенийОстатковИРезервов()

	Запрос = Новый Запрос;
    Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	РезервыОстатки.СтатьяДвижения КАК СтатьяДвижения,
	    |	ЕСТЬNULL(РезервыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	    |ПОМЕСТИТЬ ВТ_Резервы
	    |ИЗ
	    |	РегистрНакопления.РезервыДенег.Остатки(&МоментВремени, Месяц = &НачалоМесяца) КАК РезервыОстатки
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	СУММА(ВЫБОР
	    |		КОГДА ОстаткиДенег.Кошелек = &Кошелек
	    |			ТОГДА ОстаткиДенег.СуммаОстаток
	    |		ИНАЧЕ 0
	    |	КОНЕЦ) КАК ДоступноДенегВВыбранномКошельке,
	    |	СУММА(ВЫБОР
	    |		КОГДА ОстаткиДенег.Кошелек <> &Кошелек
	    |			ТОГДА ОстаткиДенег.СуммаОстаток
	    |		ИНАЧЕ 0
	    |	КОНЕЦ) КАК ДоступноДенегВОстальныхКошельках
	    |ПОМЕСТИТЬ ВТ_Остатки
	    |ИЗ
	    |	РегистрНакопления.ОстаткиДенег.Остатки(&МоментВремени,) КАК ОстаткиДенег
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВТ_Остатки.ДоступноДенегВВыбранномКошельке КАК ДоступноДенегВВыбранномКошельке,
	    |	ВТ_Остатки.ДоступноДенегВОстальныхКошельках КАК ДоступноДенегВОстальныхКошельках,
	    |	ЕСТЬNULL(ВТ_Резервы.СуммаОстаток, 0) КАК СуммаРезерваПоСтатье,
	    |	ЕСТЬNULL(ОборотыДенег.СуммаОборот, 0) КАК УжеОплаченоПоСтатье,
	    |	ВТ_Резервы.СтатьяДвижения КАК СтатьяДвижения
	    |ИЗ
	    |	ВТ_Остатки КАК ВТ_Остатки
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резервы КАК ВТ_Резервы
	    |		ПО ИСТИНА
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыДенег.Обороты(&НачалоМесяца, &МоментВремени,, СтатьяДвижения В
	    |			(ВЫБРАТЬ
	    |				СтатьяДвижения
	    |			ИЗ
	    |				ВТ_Резервы КАК ВТ_Резервы)) КАК ОборотыДенег
	    |		ПО ВТ_Резервы.СтатьяДвижения = ОборотыДенег.СтатьяДвижения";
    
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Кошелек", Кошелек);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
